## Queries and Reports

In [1]:
# CREATE A CONNECTION TO THE ELECTION DATABASE

%load_ext sql
import getpass

db_password = getpass.getpass("Enter your DB password")
connection_url = f"mysql+mysqlconnector://root:{db_password}@localhost/elections"

%sql {connection_url}

Enter your DB password········

In [19]:
# 1. List the name, city, and email of all folks
sql_query = """
SELECT f.firstName, f.lastName, pl.city, e.email
FROM folks f
LEFT JOIN emails e ON f.id = e.folkID
JOIN residence res ON f.id = res.folkID
JOIN places pl ON res.placeID = pl.placeID;
"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
15 rows affected.

[('Aaron', 'Smith', 'Leola', 'aaSmith1@example.com'),
 ('Alice', 'Sauls', 'Catonsville', 'a_sauls1234@example.com'),
 ('Boris', 'Seesh', 'Catonsville', 'Bsheesh1@example.com'),
 ('Ellie', 'Shill', 'Lancaster', 'e_shill104@example.com'),
 ('Mikey', 'Shaft', 'Catonsville', 'mike.sha@example.com'),
 ('Sofia', 'Shank', 'Leola', 'shank_daughter@example.com'),
 ('Chris', 'Faulk', 'Lancaster', None),
 ('Errin', 'Fault', 'Lancaster', 'E2rFaul@example.com'),
 ('Reene', 'Fills', 'Lancaster', None),
 ('Ollie', 'Fayne', 'Leola', None),
 ('Frank', 'Fitte', 'Leola', None),
 ('Maddy', 'Fairy', 'Leola', None),
 ('Xavie', 'Fouls', 'Catonsville', None),
 ('Yesen', 'Freem', 'Catonsville', None),
 ('Zachs', 'Flowr', 'Catonsville', None)]

In [29]:
# 2. List the city, state, and the number of residents of each city in Wonderland
sql_query = """
SELECT city, count(city) as number_of_folk_live_here
FROM places
JOIN residence ON places.placeID = residence.placeID
GROUP BY city;
"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
3 rows affected.

[('Leola', 5), ('Catonsville', 6), ('Lancaster', 4)]

In [51]:
# 3. List each state together with its number of currently inhabited places
# (include states w/ no inhabited places) in increasing alphabetical order

sql_query = """
SELECT state, count(res.folkID) as Inhabitants
FROM places pl
LEFT JOIN residence res ON pl.placeID = res.placeID
GROUP BY state
ORDER BY state ASC;
"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
3 rows affected.

[('CA', 0), ('MD', 6), ('PA', 9)]

In [9]:
# 4. Find the distinct identifiers of folks registered at a given voting center within a given time period
sql_query = """
SELECT vcID, desiredVotingDate, COUNT(folkID) as number_of_folk_registered
FROM voting_registrations
GROUP BY vcID, desiredVotingDate;
"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
9 rows affected.

[('VC4', datetime.date(2023, 11, 1), 3),
 ('VC4', datetime.date(2023, 11, 2), 3),
 ('VC4', datetime.date(2023, 12, 1), 3),
 ('VC6', datetime.date(2023, 11, 1), 3),
 ('VC6', datetime.date(2023, 11, 2), 3),
 ('VC6', datetime.date(2023, 12, 1), 3),
 ('VC3', datetime.date(2023, 11, 1), 2),
 ('VC3', datetime.date(2023, 11, 2), 2),
 ('VC3', datetime.date(2023, 12, 1), 2)]

In [68]:
# 5. Find: for a given month, the number of unique registrations 
# at any voting centers which is within 5 miles from the center 
# of Megapolis, except for voting centers in a given (exclusion) list of voting centers.

sql_query = """
SELECT COUNT(DISTINCT vr.folkID) as Unique_registration
FROM voting_registrations vr
JOIN voting_centers vc ON vr.vcID = vc.vcID
JOIN places pl ON vc.placeID = pl.placeID
WHERE SQRT(POW(pl.xCoordinate, 2) + POW(pl.yCoordinate, 2)) <= 5 
    OR vc.vcID IN ('VC1', 'VC2', 'VC6') -- exclusion list;
"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
1 rows affected.

[(5,)]

In [69]:
# 6. Find the most popular voting center(s) (in term of total number of of reigstrations) 
# in a given time period among those in a given city
given_city = 'Catonsville'
vote_date = '2023-11-01'

sql_query = """
SELECT  vc.vcID, count(vr.folkID) as total_number_of_registration
FROM voting_registrations vr
JOIN voting_centers vc ON vr.vcID = vc.vcID
JOIN places p ON vc.placeID = p.placeID
WHERE p.city = :given_city
    AND vr.desiredVotingDate = :vote_date
GROUP BY vc.vcID
LIMIT 1;
"""


%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
1 rows affected.

[('VC3', 2)]

In [32]:
# 7. Find the unique folks that have valid registrations with every voting center on a given state
given_state = "PA"

sql_query = """
SELECT firstName, lastName, pl.state
FROM folks 
JOIN voting_registrations vr ON folks.id = vr.folkID
JOIN residence res ON folks.id = res.folkID
JOIN places pl on res.placeID = pl.placeID
WHERE pl.state = :given_state
GROUP BY folks.id;
"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
6 rows affected.

[('Chris', 'Faulk', 'PA'),
 ('Errin', 'Fault', 'PA'),
 ('Reene', 'Fills', 'PA'),
 ('Ollie', 'Fayne', 'PA'),
 ('Frank', 'Fitte', 'PA'),
 ('Maddy', 'Fairy', 'PA')]

In [43]:
# 8. Find folks that registered at a voting center that is farther away
# than the voting center closest to their residence (break ties alphabetically
# by center's acronym)
sql_query = """
SELECT DISTINCT f.id, f.firstName, f.lastName
FROM folks f
JOIN residence r ON f.id = r.folkID
JOIN voting_registrations vr ON f.id = vr.folkID
JOIN voting_centers vc ON vr.vcID = vc.vcID
JOIN places residencePlace ON r.placeID = residencePlace.placeID
JOIN places votingCenterPlace ON vc.placeID = votingCenterPlace.placeID
ORDER BY f.id;

"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
8 rows affected.

[(11, 'Chris', 'Faulk'),
 (12, 'Errin', 'Fault'),
 (13, 'Reene', 'Fills'),
 (14, 'Ollie', 'Fayne'),
 (15, 'Frank', 'Fitte'),
 (16, 'Maddy', 'Fairy'),
 (17, 'Xavie', 'Fouls'),
 (18, 'Yesen', 'Freem')]

In [113]:
%%sql -- PART B, QUESTION 9

CREATE FUNCTION IF NOT EXISTS GetClosestVotingCenterAcronym(given_folk INT, given_date DATE)
RETURNS VARCHAR(255)
DETERMINISTIC
READS SQL DATA
BEGIN
    DECLARE closest_vc_acronym VARCHAR(255);

    SELECT vc.vcID
    INTO closest_vc_acronym
    FROM voting_centers vc
    JOIN operating_periods op ON vc.vcID = op.vcID
    JOIN places vcPlace ON vc.placeID = vcPlace.placeID
    JOIN (
        SELECT pl.xCoordinate, pl.yCoordinate
        FROM folks f
        JOIN residence r ON f.id = r.folkID
        JOIN places pl ON r.placeID = pl.placeID
        WHERE f.id = given_folk
    ) AS givenFolkCoordinates ON 1=1
    WHERE DATEDIFF(vcPlace.xCoordinate, givenFolkCoordinates.xCoordinate) * DATEDIFF(vcPlace.xCoordinate, givenFolkCoordinates.xCoordinate)
            + DATEDIFF(vcPlace.yCoordinate, givenFolkCoordinates.yCoordinate) * DATEDIFF(vcPlace.yCoordinate, givenFolkCoordinates.yCoordinate) <= 25 -- 5 miles squared
        AND given_date BETWEEN op.openDatetimes AND op.closeDatetimes
    ORDER BY SQRT(POW(vcPlace.xCoordinate - givenFolkCoordinates.xCoordinate, 2) + POW(vcPlace.yCoordinate - givenFolkCoordinates.yCoordinate, 2))
    LIMIT 1;

    RETURN closest_vc_acronym;
END;

SELECT GetClosestVotingCenterAcronym(12, '2023-11-01') AS ClosestVCAcronym;

 * mysql+mysqlconnector://root:***@localhost/elections
0 rows affected.
1 rows affected.

[(None,)]

In [114]:
# 10. Part B question 10

sql_query = """
SELECT
    vc.vcID AS VotingCenter,
    ba.ballotAnswer AS BallotOption,
    COUNT(vr.registrationNumber) AS Votes
FROM
    voting_registrations vr
JOIN
    voting_centers vc ON vr.vcID = vc.vcID
JOIN
    ballot_answers ba ON vr.ballotShortName = ba.ballotShortName
GROUP BY
    vc.vcID, ba.ballotAnswer
ORDER BY
    vc.vcID, ba.ballotAnswer;

"""

%sql {sql_query}

 * mysql+mysqlconnector://root:***@localhost/elections
9 rows affected.

[('VC3', 'YES', 6),
 ('VC3', 'NO', 6),
 ('VC3', 'ABSTAIN', 6),
 ('VC4', 'YES', 9),
 ('VC4', 'NO', 9),
 ('VC4', 'ABSTAIN', 9),
 ('VC6', 'YES', 9),
 ('VC6', 'NO', 9),
 ('VC6', 'ABSTAIN', 9)]